; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v5 ?v2)
             (pred_1 ?v4 ?v12)
             (pred_11 ?v5 ?v12)
             (pred_5 ?v1 ?v5 )
	     (pred_8 ?v5)
             (pred_4 ?v7)
             (pred_6 ?v4)
             (pred_9 ?v12)
             (pred_12 ?v5)
             (pred_7 ?v4)
             (pred_10 ?v5)
             (pred_3 ))



(:action op_4
:parameters (?v10 ?v13 ?v11 ?v8)
:precondition (and (pred_4 ?v10) (pred_4 ?v13) (pred_6 ?v11) (pred_9 ?v8)
          (pred_2 ?v10 ?v13) (pred_1 ?v11 ?v8)
                   (pred_11 ?v13 ?v8) (pred_8 ?v10) 
                   (pred_12 ?v13) (pred_7 ?v11))
:effect (and  (pred_10 ?v13) (not (pred_12 ?v13))))


(:action op_2
:parameters (?v10 ?v3)
:precondition (and (pred_4 ?v10) (pred_4 ?v3)
               (pred_8 ?v10) (pred_2 ?v10 ?v3) (pred_10 ?v3))
:effect (and (pred_8 ?v3) (not (pred_8 ?v10))))

(:action op_5
:parameters (?v10 ?v11)
:precondition (and (pred_4 ?v10) (pred_6 ?v11) 
                  (pred_8 ?v10) (pred_5 ?v11 ?v10) (pred_3 ))
:effect (and (pred_7 ?v11)
   (not (pred_5 ?v11 ?v10)) (not (pred_3 ))))


(:action op_3
:parameters (?v10 ?v9 ?v6)
:precondition (and (pred_4 ?v10) (pred_6 ?v9) (pred_6 ?v6)
                  (pred_8 ?v10) (pred_7 ?v6) (pred_5 ?v9 ?v10))
:effect (and (pred_7 ?v9) (pred_5 ?v6 ?v10)
        (not (pred_7 ?v6)) (not (pred_5 ?v9 ?v10))))

(:action op_1
:parameters (?v10 ?v11)
:precondition (and (pred_4 ?v10) (pred_6 ?v11) 
                  (pred_8 ?v10) (pred_7 ?v11))
:effect (and (pred_3 ) (pred_5 ?v11 ?v10) (not (pred_7 ?v11)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_31 obj_17 obj_11 obj_28 obj_24 obj_08 obj_23 obj_14 obj_03 obj_21 obj_10 obj_09 obj_27 obj_29 obj_05 obj_06 obj_22 obj_04 obj_18 obj_13 obj_07 obj_20 obj_15 obj_12 obj_01
    obj_19 obj_30 obj_26
    obj_02 obj_16 obj_25
    )

    (:init
       (pred_3)

       (pred_4 obj_31)
       (pred_4 obj_17)
       (pred_4 obj_11)
       (pred_4 obj_28)
       (pred_4 obj_24)
       (pred_4 obj_08)
       (pred_4 obj_23)
       (pred_4 obj_14)
       (pred_4 obj_03)
       (pred_4 obj_21)
       (pred_4 obj_10)
       (pred_4 obj_09)
       (pred_4 obj_27)
       (pred_4 obj_29)
       (pred_4 obj_05)
       (pred_4 obj_06)
       (pred_4 obj_22)
       (pred_4 obj_04)
       (pred_4 obj_18)
       (pred_4 obj_13)
       (pred_4 obj_07)
       (pred_4 obj_20)
       (pred_4 obj_15)
       (pred_4 obj_12)
       (pred_4 obj_01)
       (pred_9 obj_19)
       (pred_9 obj_30)
       (pred_9 obj_26)
       (pred_6 obj_02)
       (pred_6 obj_16)
       (pred_6 obj_25)

       (pred_2 obj_31 obj_08)
       (pred_2 obj_31 obj_17)
       (pred_2 obj_17 obj_23)
       (pred_2 obj_17 obj_11)
       (pred_2 obj_17 obj_31)
       (pred_2 obj_11 obj_14)
       (pred_2 obj_11 obj_28)
       (pred_2 obj_11 obj_17)
       (pred_2 obj_28 obj_03)
       (pred_2 obj_28 obj_24)
       (pred_2 obj_28 obj_11)
       (pred_2 obj_24 obj_21)
       (pred_2 obj_24 obj_28)
       (pred_2 obj_08 obj_10)
       (pred_2 obj_08 obj_23)
       (pred_2 obj_08 obj_31)
       (pred_2 obj_23 obj_09)
       (pred_2 obj_23 obj_14)
       (pred_2 obj_23 obj_17)
       (pred_2 obj_23 obj_08)
       (pred_2 obj_14 obj_27)
       (pred_2 obj_14 obj_03)
       (pred_2 obj_14 obj_11)
       (pred_2 obj_14 obj_23)
       (pred_2 obj_03 obj_29)
       (pred_2 obj_03 obj_21)
       (pred_2 obj_03 obj_28)
       (pred_2 obj_03 obj_14)
       (pred_2 obj_21 obj_05)
       (pred_2 obj_21 obj_24)
       (pred_2 obj_21 obj_03)
       (pred_2 obj_10 obj_06)
       (pred_2 obj_10 obj_09)
       (pred_2 obj_10 obj_08)
       (pred_2 obj_09 obj_22)
       (pred_2 obj_09 obj_27)
       (pred_2 obj_09 obj_23)
       (pred_2 obj_09 obj_10)
       (pred_2 obj_27 obj_04)
       (pred_2 obj_27 obj_29)
       (pred_2 obj_27 obj_14)
       (pred_2 obj_27 obj_09)
       (pred_2 obj_29 obj_18)
       (pred_2 obj_29 obj_05)
       (pred_2 obj_29 obj_03)
       (pred_2 obj_29 obj_27)
       (pred_2 obj_05 obj_13)
       (pred_2 obj_05 obj_21)
       (pred_2 obj_05 obj_29)
       (pred_2 obj_06 obj_07)
       (pred_2 obj_06 obj_22)
       (pred_2 obj_06 obj_10)
       (pred_2 obj_22 obj_20)
       (pred_2 obj_22 obj_04)
       (pred_2 obj_22 obj_09)
       (pred_2 obj_22 obj_06)
       (pred_2 obj_04 obj_15)
       (pred_2 obj_04 obj_18)
       (pred_2 obj_04 obj_27)
       (pred_2 obj_04 obj_22)
       (pred_2 obj_18 obj_12)
       (pred_2 obj_18 obj_13)
       (pred_2 obj_18 obj_29)
       (pred_2 obj_18 obj_04)
       (pred_2 obj_13 obj_01)
       (pred_2 obj_13 obj_05)
       (pred_2 obj_13 obj_18)
       (pred_2 obj_07 obj_20)
       (pred_2 obj_07 obj_06)
       (pred_2 obj_20 obj_15)
       (pred_2 obj_20 obj_22)
       (pred_2 obj_20 obj_07)
       (pred_2 obj_15 obj_12)
       (pred_2 obj_15 obj_04)
       (pred_2 obj_15 obj_20)
       (pred_2 obj_12 obj_01)
       (pred_2 obj_12 obj_18)
       (pred_2 obj_12 obj_15)
       (pred_2 obj_01 obj_13)
       (pred_2 obj_01 obj_12)
       (pred_12 obj_14)
       (pred_12 obj_21)
       (pred_12 obj_20)
       (pred_11  obj_14 obj_19)
       (pred_11  obj_21 obj_30)
       (pred_11  obj_20 obj_26)
       (pred_10 obj_31)
       (pred_10 obj_17)
       (pred_10 obj_11)
       (pred_10 obj_28)
       (pred_10 obj_24)
       (pred_10 obj_08)
       (pred_10 obj_23)
       (pred_10 obj_03)
       (pred_10 obj_10)
       (pred_10 obj_09)
       (pred_10 obj_27)
       (pred_10 obj_29)
       (pred_10 obj_05)
       (pred_10 obj_06)
       (pred_10 obj_22)
       (pred_10 obj_04)
       (pred_10 obj_18)
       (pred_10 obj_13)
       (pred_10 obj_07)
       (pred_10 obj_15)
       (pred_10 obj_12)
       (pred_10 obj_01)

       (pred_1  obj_02 obj_19)
       (pred_1  obj_16 obj_30)
       (pred_1  obj_25 obj_26)
       (pred_5 obj_02 obj_18)
       (pred_5 obj_16 obj_29)
       (pred_5 obj_25 obj_07)
       (pred_8 obj_23)
    )

    (:goal (and
       (pred_5 obj_02 obj_24)
       (pred_5 obj_16 obj_15)
       (pred_5 obj_25 obj_03)
    ))
(:constraints
  (always (not (pred_8 obj_27)))
)
)

; plan
1. (op_2 obj_23 obj_09)
   deleted: (pred_8 obj_23)
   added: (pred_8 obj_09)
   goals met: 0 of 3
2. (op_2 obj_09 obj_22)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_22)
   goals met: 0 of 3
3. (op_2 obj_22 obj_04)
   deleted: (pred_8 obj_22)
   added: (pred_8 obj_04)
   goals met: 0 of 3
4. (op_2 obj_04 obj_18)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_18)
   goals met: 0 of 3
5. (op_5 obj_18 obj_02)
   deleted: (pred_5 obj_02 obj_18) (pred_3)
   added: (pred_7 obj_02)
   goals met: 0 of 3
6. (op_2 obj_18 obj_29)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_29)
   goals met: 0 of 3
7. (op_2 obj_29 obj_03)
   deleted: (pred_8 obj_29)
   added: (pred_8 obj_03)
   goals met: 0 of 3
8. (op_1 obj_03 obj_02)
   deleted: (pred_7 obj_02)
   added: (pred_3) (pred_5 obj_02 obj_03)
   goals met: 0 of 3
9. (op_2 obj_03 obj_29)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_29)
   goals met: 0 of 3
10. (op_5 obj_29 obj_16)
   deleted: (pred_5 obj_16 obj_29) (pred_3)
   added: (pred_7 obj_16)
   goals met: 0 of 3
11. (op_2 obj_29 obj_18)
   deleted: (pred_8 obj_29)
   added: (pred_8 obj_18)
   goals met: 0 of 3
12. (op_2 obj_18 obj_04)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_04)
   goals met: 0 of 3
13. (op_2 obj_04 obj_15)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_15)
   goals met: 0 of 3
14. (op_1 obj_15 obj_16)
   deleted: (pred_7 obj_16)
   added: (pred_3) (pred_5 obj_16 obj_15)
   goals met: 1 of 3
15. (op_2 obj_15 obj_04)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_04)
   goals met: 1 of 3
16. (op_2 obj_04 obj_18)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_18)
   goals met: 1 of 3
17. (op_2 obj_18 obj_29)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_29)
   goals met: 1 of 3
18. (op_2 obj_29 obj_03)
   deleted: (pred_8 obj_29)
   added: (pred_8 obj_03)
   goals met: 1 of 3
19. (op_5 obj_03 obj_02)
   deleted: (pred_5 obj_02 obj_03) (pred_3)
   added: (pred_7 obj_02)
   goals met: 1 of 3
20. (op_2 obj_03 obj_28)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_28)
   goals met: 1 of 3
21. (op_2 obj_28 obj_24)
   deleted: (pred_8 obj_28)
   added: (pred_8 obj_24)
   goals met: 1 of 3
22. (op_1 obj_24 obj_02)
   deleted: (pred_7 obj_02)
   added: (pred_3) (pred_5 obj_02 obj_24)
   goals met: 2 of 3
23. (op_2 obj_24 obj_28)
   deleted: (pred_8 obj_24)
   added: (pred_8 obj_28)
   goals met: 2 of 3
24. (op_2 obj_28 obj_03)
   deleted: (pred_8 obj_28)
   added: (pred_8 obj_03)
   goals met: 2 of 3
25. (op_2 obj_03 obj_29)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_29)
   goals met: 2 of 3
26. (op_2 obj_29 obj_18)
   deleted: (pred_8 obj_29)
   added: (pred_8 obj_18)
   goals met: 2 of 3
27. (op_2 obj_18 obj_04)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_04)
   goals met: 2 of 3
28. (op_2 obj_04 obj_22)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_22)
   goals met: 2 of 3
29. (op_2 obj_22 obj_06)
   deleted: (pred_8 obj_22)
   added: (pred_8 obj_06)
   goals met: 2 of 3
30. (op_2 obj_06 obj_07)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_07)
   goals met: 2 of 3
31. (op_5 obj_07 obj_25)
   deleted: (pred_5 obj_25 obj_07) (pred_3)
   added: (pred_7 obj_25)
   goals met: 2 of 3
32. (op_2 obj_07 obj_06)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_06)
   goals met: 2 of 3
33. (op_2 obj_06 obj_22)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_22)
   goals met: 2 of 3
34. (op_2 obj_22 obj_04)
   deleted: (pred_8 obj_22)
   added: (pred_8 obj_04)
   goals met: 2 of 3
35. (op_2 obj_04 obj_18)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_18)
   goals met: 2 of 3
36. (op_2 obj_18 obj_29)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_29)
   goals met: 2 of 3
37. (op_2 obj_29 obj_03)
   deleted: (pred_8 obj_29)
   added: (pred_8 obj_03)
   goals met: 2 of 3
38. (op_1 obj_03 obj_25)
   deleted: (pred_7 obj_25)
   added: (pred_3) (pred_5 obj_25 obj_03)
   goals met: 3 of 3
